RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_ckcu.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the HSI auto-trim function.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_HSIAutoTrimCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->HSICR, CKCU_MASK_TRIMEN, CKCU_POS_TRIMEN, Cmd);
  CKCU_BF_WRITE(HT_CKCU->HSICR, CKCU_MASK_ATCEN, CKCU_POS_ATCEN, Cmd);
}

/*********************************************************************************************************//**
 * @brief Check Auto Trim is ready or not.
 * @retval TRUE or FALSE
 ************************************************************************************************************/
bool CKCU_HSIAutoTrimIsReady(void)
{
#if (LIBCFG_CKCU_AUTO_TRIM_LEGACY)
  u32 lower_bound, upper_bound, i;
  static u32 ATCR = 0;

  if ((HT_CKCU->HSICR & (3ul << 5)) == 0)
  {
    lower_bound = 7812 - 19;
    upper_bound = 7812 + 19;
  }
  else
  {
    lower_bound = 8000 - 20;
    upper_bound = 8000 + 20;
  }

  SystemCoreClockUpdate();
  for (i = SystemCoreClock / 8000; i > 0; i--){};
  ATCR += HT_CKCU->HSIATCR;
  ATCR /= 2;

  if ((ATCR >= lower_bound) && (ATCR <= upper_bound))
  {
    ATCR = 0;
    return TRUE;
  }
  else
  {
    return FALSE;
  }

#else
  return (HT_CKCU->HSICR & 0x80) ? TRUE : FALSE;
#endif
}
#endif

#if (LIBCFG_CKCU_HSIRDYCR)
/*********************************************************************************************************//**
 * @brief Set HSI Ready Counter Value.
 * @param Value: 0x0~0x1F.
 * @retval None
 ************************************************************************************************************/
void CKCU_Set_HSIReadyCounter(u8 Value)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_COUNTER_VALUE(Value));

  HT_CKCU->HSIRDYCR = ((HT_CKCU->HSIRDYCR) & (~(0x1F))) | Value;
}
#endif
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
